# Neovim stuffs
brew "neovim"
brew "xclip"
brew "ripgrep"
brew "fd"

# C/C++ development tools
brew "cmake"
brew "ninja"
brew "clang-format"
brew "llvm" # For clangd
brew "neocmakelsp" # For CMake

# Python development tools
brew "basedpyright"
brew "ruff"

# Lua development tools
brew "lua-language-server"
brew "stylua"

# For old machine
brew "tmux"

# For personal machine
brew "helix"
brew "zellij"

# Embedded development
brew "open-ocd"
brew "arm-none-eabi-gcc"
brew "arm-none-eabi-gdb"
brew "arm-none-eabi-binutils"
brew "qemu"
brew "probe-rs-tools"
